* 在数加系统内获得全部 features 的值
* 复制 SQL 里面的 feature 到 csv 文件中
* 读取 csv 文件到 pandas
* 获得 feature 的全部列表
* 构建 sql 语言函数
* 生成 sql 语言

In [1]:
import numpy as np 
import pandas as pd

In [33]:
(0.89 + 0.94 + 0.79)/3

0.9366666666666666

In [ ]:
,brand_id, car_height, car_length, car_width, compartment
, cylinder_number, department_id, displacement, driven_type_id
, emission_standards_id, equipment_quality, front_track
, fuel_type_id, gearbox_type, if_charging, if_luxurious_id
, if_mpv_id, level_id, newenergy_type_id, power
, price_level, rated_passenger, rear_track, total_quality
, tr, type_id, wheelbase

In [9]:
def get_sql(feature):
    """
    1. 读取各个特征的 csv 文件进入 pandas
    2. 得到全部值的列表
    3. 打印全部值的 sql 语言 
    """
    # 读取 pandas 文件
    df = pd.read_csv('../../raw/LiChuan/features/{}.csv'.format(feature))
    
    # 得到全部 brand_id 的列表
    feature_ids = []
    for index, row in df.iterrows():
        feature_ids.append(str(row.values[0]))
        
        
    """
    用于 One-hot 编码的 sql 语言生成
    """
    for i in feature_ids:
        if ";" in i:
            x = i.split(";")[0] + "_" + i.split(";")[1] # 将 xx;xx, 形式转换成 xx_xx 形式, 这样 sql 才能读取
            print('case when {}={} then 1.0 else 0.0 end as {}_{},'.format(feature, i, feature, str(x)))
        else:
            print('case when {}={} then 1.0 else 0.0 end as {}_{},'.format(feature, i, feature, str(i)))
    
    """
    用于相同 class_id 进行 merge 的 sql 语言生成
    """
    for j in feature_ids:
        if ";" in j:
            m = feature + "_" + j.split(";")[0] + "_" + j.split(";")[1] 
            print(",case when sum(" + m + ")!= 0 then 1 else 0 end as " + m)
        else:
            n = feature + "_" + j
            print(",case when sum(" + n + ")!= 0 then 1 else 0 end as " + n)
            
    """
    用于特征序列的 sql 语言生成
    """
    for j in feature_ids:
        if ";" in j:
            m = feature + "_" + j.split(";")[0] + "_" + j.split(";")[1] # 将 xx;xx, 形式转换成 xx_xx 形式, 这样 sql 才能读取
            print("," + m)
        else:
            n = feature + "_" + j
            print("," + n)

In [ ]:
# 需要进行 one-hot 编码的特征名
features = ['brand_id', 'compartment', 'type_id', 'level_id', 'department_id' ,'tr', 'gearbox_type'
            , 'if_charging', 'driven_type_id', 'fuel_type_id'
            ,'newenergy_type_id', 'emission_standards_id' , 'if_mpv_id(不用编码)', 'if_luxurious_id(不用编码)'
            ,'cylinder_number', ]

In [13]:
# 需要进行 one-hot 编码的特征名
features = ['brand_id', 'compartment', 'type_id', 'level_id', 'department_id' ,'tr', 'gearbox_type'
            , 'if_charging', 'driven_type_id', 'fuel_type_id'
            ,'newenergy_type_id', 'emission_standards_id' ,'cylinder_number', ]

In [14]:
# feautre
for feature in features:
    get_sql(feature)

,case when sum(brand_id_15)!= 0 then 1 else 0 end as brand_id_15
,case when sum(brand_id_18)!= 0 then 1 else 0 end as brand_id_18
,case when sum(brand_id_21)!= 0 then 1 else 0 end as brand_id_21
,case when sum(brand_id_27)!= 0 then 1 else 0 end as brand_id_27
,case when sum(brand_id_30)!= 0 then 1 else 0 end as brand_id_30
,case when sum(brand_id_36)!= 0 then 1 else 0 end as brand_id_36
,case when sum(brand_id_39)!= 0 then 1 else 0 end as brand_id_39
,case when sum(brand_id_42)!= 0 then 1 else 0 end as brand_id_42
,case when sum(brand_id_48)!= 0 then 1 else 0 end as brand_id_48
,case when sum(brand_id_57)!= 0 then 1 else 0 end as brand_id_57
,case when sum(brand_id_60)!= 0 then 1 else 0 end as brand_id_60
,case when sum(brand_id_63)!= 0 then 1 else 0 end as brand_id_63
,case when sum(brand_id_66)!= 0 then 1 else 0 end as brand_id_66
,case when sum(brand_id_69)!= 0 then 1 else 0 end as brand_id_69
,case when sum(brand_id_84)!= 0 then 1 else 0 end as brand_id_84
,case when sum(brand_id_99)!= 0 then 1 else 0 end as brand_id_99
,case when sum(brand_id_102)!= 0 then 1 else 0 end as brand_id_102
,case when sum(brand_id_108)!= 0 then 1 else 0 end as brand_id_108
,case when sum(brand_id_117)!= 0 then 1 else 0 end as brand_id_117
,case when sum(brand_id_123)!= 0 then 1 else 0 end as brand_id_123
,case when sum(brand_id_126)!= 0 then 1 else 0 end as brand_id_126
,case when sum(brand_id_129)!= 0 then 1 else 0 end as brand_id_129
,case when sum(brand_id_132)!= 0 then 1 else 0 end as brand_id_132
,case when sum(brand_id_135)!= 0 then 1 else 0 end as brand_id_135
,case when sum(brand_id_138)!= 0 then 1 else 0 end as brand_id_138
,case when sum(brand_id_141)!= 0 then 1 else 0 end as brand_id_141
,case when sum(brand_id_165)!= 0 then 1 else 0 end as brand_id_165
,case when sum(brand_id_225)!= 0 then 1 else 0 end as brand_id_225
,case when sum(brand_id_237)!= 0 then 1 else 0 end as brand_id_237
,case when sum(brand_id_10)!= 0 then 1 else 0 end as brand_id_10
,case when sum(brand_id_13)!= 0 then 1 else 0 end as brand_id_13
,case when sum(brand_id_16)!= 0 then 1 else 0 end as brand_id_16
,case when sum(brand_id_22)!= 0 then 1 else 0 end as brand_id_22
,case when sum(brand_id_25)!= 0 then 1 else 0 end as brand_id_25
,case when sum(brand_id_28)!= 0 then 1 else 0 end as brand_id_28
,case when sum(brand_id_31)!= 0 then 1 else 0 end as brand_id_31
,case when sum(brand_id_34)!= 0 then 1 else 0 end as brand_id_34
,case when sum(brand_id_37)!= 0 then 1 else 0 end as brand_id_37
,case when sum(brand_id_43)!= 0 then 1 else 0 end as brand_id_43
,case when sum(brand_id_46)!= 0 then 1 else 0 end as brand_id_46
,case when sum(brand_id_49)!= 0 then 1 else 0 end as brand_id_49
,case when sum(brand_id_52)!= 0 then 1 else 0 end as brand_id_52
,case when sum(brand_id_55)!= 0 then 1 else 0 end as brand_id_55
,case when sum(brand_id_58)!= 0 then 1 else 0 end as brand_id_58
,case when sum(brand_id_67)!= 0 then 1 else 0 end as brand_id_67
,case when sum(brand_id_79)!= 0 then 1 else 0 end as brand_id_79
,case when sum(brand_id_82)!= 0 then 1 else 0 end as brand_id_82
,case when sum(brand_id_91)!= 0 then 1 else 0 end as brand_id_91
,case when sum(brand_id_94)!= 0 then 1 else 0 end as brand_id_94
,case when sum(brand_id_100)!= 0 then 1 else 0 end as brand_id_100
,case when sum(brand_id_103)!= 0 then 1 else 0 end as brand_id_103
,case when sum(brand_id_109)!= 0 then 1 else 0 end as brand_id_109
,case when sum(brand_id_121)!= 0 then 1 else 0 end as brand_id_121
,case when sum(brand_id_127)!= 0 then 1 else 0 end as brand_id_127
,case when sum(brand_id_130)!= 0 then 1 else 0 end as brand_id_130
,case when sum(brand_id_133)!= 0 then 1 else 0 end as brand_id_133
,case when sum(brand_id_139)!= 0 then 1 else 0 end as brand_id_139
,case when sum(brand_id_142)!= 0 then 1 else 0 end as brand_id_142
,case when sum(brand_id_145)!= 0 then 1 else 0 end as brand_id_145
,case when sum(brand_id_187)!= 0 then 1 else 0 end as brand_id_187
,case when sum(brand_id_223)!= 0 then 1 else 0 end as brand_id_223
,case when sum(brand_id_229)!= 0 then 1 else 0 end as brand_id_229
,case when sum(brand_id_232)!= 0 then 1 else 0 end as brand_id_232
,case when sum(brand_id_235)!= 0 then 1 else 0 end as brand_id_235
,case when sum(brand_id_238)!= 0 then 1 else 0 end as brand_id_238
,case when sum(brand_id_2)!= 0 then 1 else 0 end as brand_id_2
,case when sum(brand_id_8)!= 0 then 1 else 0 end as brand_id_8
,case when sum(brand_id_11)!= 0 then 1 else 0 end as brand_id_11
,case when sum(brand_id_14)!= 0 then 1 else 0 end as brand_id_14
,case when sum(brand_id_17)!= 0 then 1 else 0 end as brand_id_17
,case when sum(brand_id_23)!= 0 then 1 else 0 end as brand_id_23
,case when sum(brand_id_29)!= 0 then 1 else 0 end as brand_id_29
,case when sum(brand_id_32)!= 0 then 1 else 0 end as brand_id_32
,case when sum(brand_id_35)!= 0 then 1 else 0 end as brand_id_35
,case when sum(brand_id_38)!= 0 then 1 else 0 end as brand_id_38
,case when sum(brand_id_41)!= 0 then 1 else 0 end as brand_id_41
,case when sum(brand_id_47)!= 0 then 1 else 0 end as brand_id_47
,case when sum(brand_id_50)!= 0 then 1 else 0 end as brand_id_50
,case when sum(brand_id_53)!= 0 then 1 else 0 end as brand_id_53
,case when sum(brand_id_56)!= 0 then 1 else 0 end as brand_id_56
,case when sum(brand_id_59)!= 0 then 1 else 0 end as brand_id_59
,case when sum(brand_id_65)!= 0 then 1 else 0 end as brand_id_65
,case when sum(brand_id_68)!= 0 then 1 else 0 end as brand_id_68
,case when sum(brand_id_77)!= 0 then 1 else 0 end as brand_id_77
,case when sum(brand_id_80)!= 0 then 1 else 0 end as brand_id_80
,case when sum(brand_id_83)!= 0 then 1 else 0 end as brand_id_83
,case when sum(brand_id_86)!= 0 then 1 else 0 end as brand_id_86
,case when sum(brand_id_95)!= 0 then 1 else 0 end as brand_id_95
,case when sum(brand_id_98)!= 0 then 1 else 0 end as brand_id_98
,case when sum(brand_id_101)!= 0 then 1 else 0 end as brand_id_101
,case when sum(brand_id_104)!= 0 then 1 else 0 end as brand_id_104
,case when sum(brand_id_110)!= 0 then 1 else 0 end as brand_id_110
,case when sum(brand_id_122)!= 0 then 1 else 0 end as brand_id_122
,case when sum(brand_id_125)!= 0 then 1 else 0 end as brand_id_125
,case when sum(brand_id_134)!= 0 then 1 else 0 end as brand_id_134
,case when sum(brand_id_137)!= 0 then 1 else 0 end as brand_id_137
,case when sum(brand_id_140)!= 0 then 1 else 0 end as brand_id_140
,case when sum(brand_id_143)!= 0 then 1 else 0 end as brand_id_143
,case when sum(brand_id_173)!= 0 then 1 else 0 end as brand_id_173
,case when sum(brand_id_185)!= 0 then 1 else 0 end as brand_id_185
,case when sum(brand_id_200)!= 0 then 1 else 0 end as brand_id_200
,case when sum(brand_id_209)!= 0 then 1 else 0 end as brand_id_209
,case when sum(brand_id_221)!= 0 then 1 else 0 end as brand_id_221
,case when sum(brand_id_227)!= 0 then 1 else 0 end as brand_id_227
,case when sum(brand_id_230)!= 0 then 1 else 0 end as brand_id_230
,case when sum(brand_id_233)!= 0 then 1 else 0 end as brand_id_233
,case when sum(brand_id_236)!= 0 then 1 else 0 end as brand_id_236
,case when sum(brand_id_239)!= 0 then 1 else 0 end as brand_id_239
,case when sum(brand_id_245)!= 0 then 1 else 0 end as brand_id_245
,case when sum(compartment_1)!= 0 then 1 else 0 end as compartment_1
,case when sum(compartment_2)!= 0 then 1 else 0 end as compartment_2
,case when sum(compartment_3)!= 0 then 1 else 0 end as compartment_3
,case when sum(type_id_1)!= 0 then 1 else 0 end as type_id_1
,case when sum(type_id_2)!= 0 then 1 else 0 end as type_id_2
,case when sum(type_id_3)!= 0 then 1 else 0 end as type_id_3
,case when sum(type_id_4)!= 0 then 1 else 0 end as type_id_4
,case when sum(level_id_0)!= 0 then 1 else 0 end as level_id_0
,case when sum(level_id_1)!= 0 then 1 else 0 end as level_id_1
,case when sum(level_id_2)!= 0 then 1 else 0 end as level_id_2
,case when sum(level_id_3)!= 0 then 1 else 0 end as level_id_3
,case when sum(level_id_4)!= 0 then 1 else 0 end as level_id_4
,case when sum(level_id_5)!= 0 then 1 else 0 end as level_id_5
,case when sum(level_id_6)!= 0 then 1 else 0 end as level_id_6
,case when sum(level_id_7)!= 0 then 1 else 0 end as level_id_7
,case when sum(department_id_0)!= 0 then 1 else 0 end as department_id_0
,case when sum(department_id_1)!= 0 then 1 else 0 end as department_id_1
,case when sum(department_id_2)!= 0 then 1 else 0 end as department_id_2
,case when sum(department_id_3)!= 0 then 1 else 0 end as department_id_3
,case when sum(department_id_4)!= 0 then 1 else 0 end as department_id_4
,case when sum(department_id_5)!= 0 then 1 else 0 end as department_id_5
,case when sum(tr_0)!= 0 then 1 else 0 end as tr_0
,case when sum(tr_1)!= 0 then 1 else 0 end as tr_1
,case when sum(tr_1_2)!= 0 then 1 else 0 end as tr_1_2
,case when sum(tr_2)!= 0 then 1 else 0 end as tr_2
,case when sum(tr_4)!= 0 then 1 else 0 end as tr_4
,case when sum(tr_4_5)!= 0 then 1 else 0 end as tr_4_5
,case when sum(tr_4_6)!= 0 then 1 else 0 end as tr_4_6
,case when sum(tr_5)!= 0 then 1 else 0 end as tr_5
,case when sum(tr_5_0)!= 0 then 1 else 0 end as tr_5_0
,case when sum(tr_5_4)!= 0 then 1 else 0 end as tr_5_4
,case when sum(tr_5_6)!= 0 then 1 else 0 end as tr_5_6
,case when sum(tr_5_7)!= 0 then 1 else 0 end as tr_5_7
,case when sum(tr_6)!= 0 then 1 else 0 end as tr_6
,case when sum(tr_6_0)!= 0 then 1 else 0 end as tr_6_0
,case when sum(tr_6_7)!= 0 then 1 else 0 end as tr_6_7
,case when sum(tr_7)!= 0 then 1 else 0 end as tr_7
,case when sum(tr_8)!= 0 then 1 else 0 end as tr_8
,case when sum(tr_8_0)!= 0 then 1 else 0 end as tr_8_0
,case when sum(tr_8_7)!= 0 then 1 else 0 end as tr_8_7
,case when sum(tr_9)!= 0 then 1 else 0 end as tr_9
,case when sum(gearbox_type_AMT)!= 0 then 1 else 0 end as gearbox_type_AMT
,case when sum(gearbox_type_AT)!= 0 then 1 else 0 end as gearbox_type_AT
,case when sum(gearbox_type_AT_CVT)!= 0 then 1 else 0 end as gearbox_type_AT_CVT
,case when sum(gearbox_type_AT_DCT)!= 0 then 1 else 0 end as gearbox_type_AT_DCT
,case when sum(gearbox_type_CVT)!= 0 then 1 else 0 end as gearbox_type_CVT
,case when sum(gearbox_type_DCT)!= 0 then 1 else 0 end as gearbox_type_DCT
,case when sum(gearbox_type_MT)!= 0 then 1 else 0 end as gearbox_type_MT
,case when sum(gearbox_type_MT_AMT)!= 0 then 1 else 0 end as gearbox_type_MT_AMT
,case when sum(gearbox_type_MT_AT)!= 0 then 1 else 0 end as gearbox_type_MT_AT
,case when sum(gearbox_type_MT_CVT)!= 0 then 1 else 0 end as gearbox_type_MT_CVT
,case when sum(if_charging_L)!= 0 then 1 else 0 end as if_charging_L
,case when sum(if_charging_T)!= 0 then 1 else 0 end as if_charging_T
,case when sum(driven_type_id_0)!= 0 then 1 else 0 end as driven_type_id_0
,case when sum(driven_type_id_1)!= 0 then 1 else 0 end as driven_type_id_1
,case when sum(driven_type_id_2)!= 0 then 1 else 0 end as driven_type_id_2
,case when sum(driven_type_id_3)!= 0 then 1 else 0 end as driven_type_id_3
,case when sum(fuel_type_id_0)!= 0 then 1 else 0 end as fuel_type_id_0
,case when sum(fuel_type_id_1)!= 0 then 1 else 0 end as fuel_type_id_1
,case when sum(fuel_type_id_2)!= 0 then 1 else 0 end as fuel_type_id_2
,case when sum(fuel_type_id_3)!= 0 then 1 else 0 end as fuel_type_id_3
,case when sum(fuel_type_id_4)!= 0 then 1 else 0 end as fuel_type_id_4
,case when sum(newenergy_type_id_0)!= 0 then 1 else 0 end as newenergy_type_id_0
,case when sum(newenergy_type_id_1)!= 0 then 1 else 0 end as newenergy_type_id_1
,case when sum(newenergy_type_id_2)!= 0 then 1 else 0 end as newenergy_type_id_2
,case when sum(newenergy_type_id_3)!= 0 then 1 else 0 end as newenergy_type_id_3
,case when sum(newenergy_type_id_4)!= 0 then 1 else 0 end as newenergy_type_id_4
,case when sum(emission_standards_id_0)!= 0 then 1 else 0 end as emission_standards_id_0
,case when sum(emission_standards_id_1)!= 0 then 1 else 0 end as emission_standards_id_1
,case when sum(emission_standards_id_2)!= 0 then 1 else 0 end as emission_standards_id_2
,case when sum(emission_standards_id_3)!= 0 then 1 else 0 end as emission_standards_id_3
,case when sum(emission_standards_id_4)!= 0 then 1 else 0 end as emission_standards_id_4
,case when sum(cylinder_number_0)!= 0 then 1 else 0 end as cylinder_number_0
,case when sum(cylinder_number_3)!= 0 then 1 else 0 end as cylinder_number_3
,case when sum(cylinder_number_4)!= 0 then 1 else 0 end as cylinder_number_4
,case when sum(cylinder_number_5)!= 0 then 1 else 0 end as cylinder_number_5
,case when sum(cylinder_number_6)!= 0 then 1 else 0 end as cylinder_number_6
,case when sum(cylinder_number_8)!= 0 then 1 else 0 end as cylinder_number_8
,case when sum(cylinder_number_12)!= 0 then 1 else 0 end as cylinder_number_12

In [31]:
# 2012-2017 年
for i in range(1, 13):
    if i in range(10):
        print (
        """
        DROP TABLE IF EXISTS stuff_{};
        CREATE TABLE stuff_{}
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '20170{}'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '20170{}'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE 
                stuff_{}
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_{};

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE 
                WHEN a.sale_date = '20170{}' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_{} b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;
        """
        .format(i, i, i, i-1, i, i, i, i))
    else:
        print (
        """
        DROP TABLE IF EXISTS stuff_{};
        CREATE TABLE stuff_{}
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '2017{}'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '2017{}'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE 
                stuff_{}
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_{};

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE 
                WHEN a.sale_date = '2017{}' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_{} b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;
        """
        .format(i, i, i, i-1, i, i, i, i))

        DROP TABLE IF EXISTS stuff_1;
        CREATE TABLE stuff_1
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201701'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201700'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_1
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_1;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201701' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_1 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_2;
        CREATE TABLE stuff_2
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201702'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201701'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_2
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_2;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201702' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_2 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_3;
        CREATE TABLE stuff_3
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201703'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201702'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_3
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_3;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201703' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_3 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_4;
        CREATE TABLE stuff_4
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201704'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201703'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_4
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_4;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201704' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_4 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_5;
        CREATE TABLE stuff_5
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201705'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201704'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_5
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_5;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201705' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_5 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_6;
        CREATE TABLE stuff_6
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201706'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201705'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_6
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_6;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201706' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_6 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_7;
        CREATE TABLE stuff_7
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201707'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201706'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_7
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_7;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201707' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_7 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_8;
        CREATE TABLE stuff_8
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201708'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201707'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_8
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_8;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201708' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_8 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_9;
        CREATE TABLE stuff_9
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201709'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201708'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_9
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_9;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201709' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_9 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_10;
        CREATE TABLE stuff_10
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201710'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '20179'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_10
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_10;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201710' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_10 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_11;
        CREATE TABLE stuff_11
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201711'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201710'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_11
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_11;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201711' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_11 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;


        DROP TABLE IF EXISTS stuff_12;
        CREATE TABLE stuff_12
        AS
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity, b.how_many_month_sale
        FROM (
            SELECT sale_date, city_id, class_id, sale_quantity
            FROM stuff_lichuan0306_feature_11_how_many_month_sale a
            WHERE sale_date = '201712'
        ) a
        LEFT OUTER JOIN (
            SELECT city_id, class_id, how_many_month_sale
            FROM stuff_lichuan0306_feature_11_how_many_month_sale
            WHERE sale_date = '201711'
        ) b
        ON a.city_id = b.city_id
            AND a.class_id = b.class_id;

        INSERT OVERWRITE TABLE
                stuff_12
        Select sale_date, city_id, class_id, sale_quantity
            ,case
                when sale_quantity != 0
                    then how_many_month_sale + 1
                else how_many_month_sale
            end as how_many_month_sale
        from stuff_12;

        INSERT OVERWRITE TABLE stuff_lichuan0306_feature_11_how_many_month_sale
        SELECT a.sale_date, a.city_id, a.class_id, a.sale_quantity
            , CASE
                WHEN a.sale_date = '201712' THEN b.how_many_month_sale
                ELSE a.how_many_month_sale
            END AS how_many_month_sale
        FROM stuff_lichuan0306_feature_11_how_many_month_sale a
        LEFT OUTER JOIN stuff_12 b
        ON a.sale_date = b.sale_date
            AND a.city_id = b.city_id
            AND a.class_id = b.class_id;